app/controllers/messages_controller.rb

  def create
    @message = current_user.messages.build(message_params)
    chat=Chat.find_by_id(params[:chat_room])
    redirect_to chats_path, flash: {:warning => '此聊天不存在'} and return if chat.nil?
    @message.chat=chat
    if @message.save
---
SELECT  "chats".* FROM "chats" WHERE "chats"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "messages" ("body", "user_id", "chat_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "111"], ["user_id", 2], ["chat_id", 4], ["created_at", "2018-12-10 10:05:43.227942"], ["updated_at", "2018-12-10 10:05:43.227942"]]