app/controllers/users_controller.rb

  def update
    if @user.update_attributes(user_params)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$uYU1lmARL7qdJshpVqlb0.AIOInMms.pcZTLDHrAHdViSm2FElMbK"], ["updated_at", "2018-12-05 12:49:30.499549"], ["id", 1]]

  def set_user
    @user=User.find_by_id(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]